MrToast99/Nextube-Remaster/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32"

# Flash - 16MB
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM - 8MB chip, but the original ESP32 MMU can only map 4MB at a time.
# Setting SPIRAM_SIZE to 4MB caps the driver's mapping attempt to the MMU
# limit and suppresses the "Virtual address not enough for PSRAM" warning.
CONFIG_ESP32_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
# SPIRAM_MALLOC_ALWAYSINTERNAL threshold — malloc calls ≤ this value are
# forced to internal SRAM; calls > this value fall through to PSRAM.
#
# 4096 was tested and rejected: CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096
# produces OUT_BUFFER_LEN = exactly 4096 bytes in IDF 5.5.3.  That sits
# exactly at the old threshold (≤ 4096 → SRAM), so mbedtls_ssl_setup()
# still allocates the OUT buffer from internal SRAM.  Subscriber-build
# additions (3 mutexes, larger config struct, task TCBs all via pvPortMalloc)
# fragmented SRAM such that no contiguous 4096-byte block survives to t≈20 s;
# ssl_setup() returns MBEDTLS_ERR_SSL_ALLOC_FAILED (-0x7F00) on every retry.
#
# 3072 was tested and rejected: ssl_setup() now succeeds (both IN=16 KB and
# OUT=4 KB exceed the threshold → PSRAM), but api.met.no's cert chain roots
# at an RSA-4096 CA.  Certificate verification calls mbedtls_mpi_exp_mod()
# via the hardware RSA path, which calls mbedtls_mpi_grow(&X, 128_words) =
# a 512-byte calloc.  512 < 3072 → still forced to internal SRAM → SRAM is
# too fragmented at t≈23 s to satisfy a 512-byte contiguous request →
# MBEDTLS_ERR_MPI_ALLOC_FAILED ORed into MBEDTLS_ERR_RSA_PUBLIC_FAILED = 0x4290.
#
# 511 is the working value:
#   • 512-byte RSA-4096 limb arrays  > 511 → PSRAM.
#     The ESP32 hardware RSA engine loads operands via CPU I/O writes to
#     dedicated peripheral registers (not DMA), so PSRAM limb-array pointers
#     are safe — the CPU fetches each 32-bit word through the SPI cache and
#     writes it to the RSA peripheral; no DMA mapping required.
#   • 4096-byte SSL OUT buffer       > 511 → PSRAM  (ssl_setup succeeds)
#   • 16384-byte SSL IN buffer       > 511 → PSRAM  (was already PSRAM)
#   • WPA2-PSK AES context (~280 B)  ≤ 511 → SRAM  ← critical for DMA safety
#   • WPA2-PSK SHA context (~120 B)  ≤ 511 → SRAM
#   • HMAC context (~400 B)          ≤ 511 → SRAM
#   (Hardware AES/SHA on original ESP32 use DMA and require internal-SRAM
#    buffers.  Keeping all crypto contexts ≤ 511 B keeps them in SRAM and
#    avoids the "DNS fails with error 202" failure that
#    MBEDTLS_MEM_ALLOC_MODE_EXTERNAL produced by routing ALL mbedTLS
#    allocations — including AES context structs — to PSRAM.)
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=511
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SIZE=4194304

# CPU frequency
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# Wi-Fi
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
# Double the TX buffer pool (default 32) so TLS handshake packets and
# concurrent HTTP responses don't compete and cause EAGAIN on sends.
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=64

# HTTP Server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# Watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# OTA
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# mDNS
CONFIG_MDNS_MAX_SERVICES=10
# Disable automatic mDNS registration for the AP netif.
# By default IDF 5.x mDNS registers ALL netifs (STA, AP, ETH) automatically
# via built-in event handlers when each interface comes up.  We do our own
# explicit mdns_register_netif(s_sta_netif) in start_mdns(), so we only want
# STA registered.  With AP auto-registration enabled, any WIFI_EVENT_AP_START
# fired after mdns_init() (fallback AP, reconnect) causes mDNS to probe on the
# AP interface and announce to the LAN — producing a 1-second "espressif" blip
# on the Unifi controller (or any mDNS-aware client) on every announcement
# cycle until the probe settles.  Turning it off here ensures the AP interface
# is never presented to LAN-side mDNS resolvers.
CONFIG_MDNS_PREDEF_NETIF_AP=n

# LWIP netif default hostname.
# This controls the name the device uses in DHCP client requests (option 12)
# and is the hostname the mDNS stack reads from the netif during mdns_init().
# Without this, the netif hostname defaults to "espressif", causing the device
# to announce itself as "espressif.localdomain" on the LAN and send mDNS probes
# with "espressif" before mdns_hostname_set() (which is async) takes effect.
# The start_mdns() function also calls esp_netif_set_hostname() at runtime to
# apply the user-configured hostname from config; this default ensures the very
# first probe — fired the moment mdns_init() starts the task — is already
# correct even before that runtime call executes.
CONFIG_LWIP_LOCAL_HOSTNAME="nextube-remaster"

# TLS / HTTPS
# Enable the built-in Mozilla CA certificate bundle so esp_crt_bundle_attach()
# works in the weather HTTP client.  Without this the bundle is empty and
# esp-tls rejects the connection with "No server verification option set".
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
# Partial bundle (~30 KB, ~40 curated CAs).
# The full bundle (~70 KB, 150+ CAs) was tested and rejected.
# With HARDWARE_MPI=y (enabled) cert verification uses the hardware RSA engine
# which requires dedicated SRAM scratch registers.  The full bundle's larger
# initialisation footprint leaves less SRAM headroom; at t≈20 s the scratch
# allocation inside ssl_setup() fails even on the second attempt, still
# producing the 0x4290 error (MBEDTLS_ERR_RSA_PUBLIC_FAILED |
# MBEDTLS_ERR_MPI_ALLOC_FAILED).  The partial bundle's smaller footprint
# leaves enough headroom for the hardware RSA scratch on the retry.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_PARTIAL=y
#
# TLS I/O buffer sizing.
# IN must stay at 16 384 — Met.no sends TLS records that fill the maximum
# record size; mbedtls_ssl_read returns -0x7100 (CONN_EOF) with anything
# smaller.  OUT can safely be 4 096: device→server HTTP requests are always
# well under 4 KB.
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096
#
# TLS memory strategy.
#
# MBEDTLS_DYNAMIC_BUFFER was tested and rejected: its "Dynamic Impl" path calls
# heap_caps_malloc(size, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT) explicitly, so
# the 16 KB IN buffer is still internal SRAM.  Worse, it allocates that buffer
# *after* cert validation, when bignum/RSA ops have fragmented the heap — the
# alloc fails even though cert validation itself just succeeded.
#
# MBEDTLS_MEM_ALLOC_MODE_EXTERNAL and custom mbedtls_platform_set_calloc_free()
# were also tested and rejected: both route ALL mbedTLS calls to PSRAM, which
# breaks the WPA2/WPA3 supplicant's hardware-crypto paths (hardware AES/SHA on
# original ESP32 requires DMA-accessible = internal SRAM buffers), causing DNS
# to fail with error 202 after WiFi connects.
#
# Working strategy — three parts:
#  1. No DYNAMIC_BUFFER + ALWAYSINTERNAL=3072: ssl_setup() allocates the IN/OUT
#     buffers at connection open time.  Both exceed the 3072-byte threshold
#     (IN = 16 KB, OUT = 4 KB) so they are allocated from PSRAM — 8 MB of
#     unfragmented heap — rather than the scarce internal SRAM.  ssl_setup()
#     therefore succeeds regardless of how fragmented internal SRAM becomes.
#  2. TLS semaphore (tls_sem_take/give in config_mgr): only one ssl_context
#     lives at a time, preventing concurrent PSRAM pressure.
#  3. DHCP DNS: left as-is; the router's DNS resolves external hostnames
#     correctly without intervention.
#
# Hardware RSA accelerator — left at default (ENABLED).
# CONFIG_MBEDTLS_HARDWARE_MPI=n was tested and rejected.  The software RSA
# path allocates a sliding-window precomputation table W[2 << WINDOW_SIZE]
# of temporary MPIs.  For the RSA-4096 key in ISRG Root X1 (the root CA for
# the Open-Meteo / Let's Encrypt chain) each W[i] limb array is 512 bytes.
# With SPIRAM_MALLOC_ALWAYSINTERNAL=4096, these 512-byte allocations cannot
# fall back to PSRAM; at t≈20 s they exhaust the remaining internal SRAM,
# causing mbedtls_mpi_exp_mod() to return MBEDTLS_ERR_MPI_ALLOC_FAILED.
# This ORs with MBEDTLS_ERR_RSA_PUBLIC_FAILED to produce the observed 0x4290
# error ("PK verify failed / Certificate matched but signature verification
# failed").  The hardware RSA engine bypasses W[] entirely — it loads N and E
# directly into dedicated hardware registers and performs the modular
# exponentiation there, so no SRAM window arrays are needed.

# LWIP
CONFIG_LWIP_MAX_SOCKETS=32
CONFIG_LWIP_SNTP_MAX_SERVERS=4

# NVS
CONFIG_NVS_ENCRYPTION=n

# ── IRAM optimisation ─────────────────────────────────────────────────
# IRAM overflows by ~5 KB when esp_jpeg + WiFi + BT all load.
# Move non-ISR-critical code to flash to free headroom.

# FreeRTOS tick hook and utility functions don't need to be in IRAM.
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y

# We use spi_device_polling_transmit exclusively – the DMA/ISR path
# for SPI master is never exercised, so save the IRAM it would occupy.
CONFIG_SPI_MASTER_ISR_IN_IRAM=n

# Ring-buffer ISR and helper functions (used by RMT LED driver and I2S)
# can live in flash; latency is acceptable for our use case.
CONFIG_RINGBUF_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_RINGBUF_PLACE_ISR_FUNCTIONS_INTO_FLASH=y

# ── Microphone sampling ───────────────────────────────────────────────
# The mic driver uses ESP_TIMER_TASK dispatch + adc_oneshot_read().
# No ISR-safe ADC variant is needed (adc_oneshot_read_isr is not available
# on the original ESP32 in IDF 5.x), and no IRAM placement is required.
# ESP_TIMER_TASK callbacks run in the esp_timer service task (priority 22),
# where the normal mutex-based adc_oneshot_read() is perfectly safe.
# The esp_timer service task stack is bumped to 8 KB (default 4 KB) because
# adc_oneshot_read() → ADC HAL → ADC LL → hardware-access helpers adds ~3 KB
# of call-chain depth on top of the task's own frame; the default 4 KB was
# occasionally tight under production conditions when both WiFi events and
# the timer callback fire concurrently on Core 0.
CONFIG_ESP_TIMER_TASK_STACK_SIZE=8192

